mfo/20240331223036-mfo_introducao_ao_tla.org
:PROPERTIES:
:ID:       08216603-fab5-4c23-bbde-ccb3be47757f
:END:
#+title: Introdução ao TLA+
#+EMAIL:     gabrielamoreira05@gmail.com
#+DATE:      2024-04-08
#+LANGUAGE:  en
#+OPTIONS:   H:2 num:t toc:nil \n:t @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:nil pri:nil tags:not-in-toc
#+BEAMER_FRAME_LEVEL: 2
#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [smaller]
#+BEAMER_THEME: udesc
#+BEAMER_HEADER: \input{header.tex} \subtitle{Aula para disciplina de Métodos Formais} \institute{Departamento de Ciência da Computação - DCC\\Universidade do Estado de Santa Catarina - UDESC}
#+LATEX_COMPILER: pdflatex
#+bibliography: references.bib
#+cite_export: csl ~/MEGA/csl/associacao-brasileira-de-normas-tecnicas.csl
#+PROPERTY: header-args :tangle tictactoe.qnt
#+HTML: <a href="https://bugarela.com/mfo/slides/20240331223036-mfo_introducao_ao_tla.pdf">Slides</a><br />
#+beamer: \begin{frame}{Conteúdo}
#+TOC: headlines 3
#+beamer: \end{frame}

* Quint -> TLA+
** Quint -> TLA+
Já aprendemos Quint, então vamos ver TLA+ pensando nas equivalencias com Quint.
- O próprio [[https://github.com/informalsystems/quint/blob/main/doc/lang.md][Manual do Quint]] trás essas comparações entra TLA+ e Quint

** Tipos
TLA+ não tem tipos!
#+BEAMER: \pause
- No TLC, erros de tipo serão detectados em runtime
  - Se seu modelo tiver =1 + "bla"= no sétimo estado da execução, o TLC só vai perceber o problema quando chegar nesse estado em sua exploração
#+BEAMER: \pause
- No Apalache, é preciso traduzir o modelo para fórmulas SMT, que precisam ser tipadas
  - TLA+ para o Apalache é tipado
  - A linguagem em si não é tipada, mas o Apalache espera que os tipos sejam anotados nos comentários
    #+begin_src tla
    VARIABLES
      \* @type: Int -> Int;
      clock,
      \* @type: Int -> (Int -> Int);
      req,
      \* @type: Int -> Set(Int);
      ack,
    #+end_src
  - Mais informações no [[https://apalache.informal.systems/docs/tutorials/snowcat-tutorial.html][Manual do Apalache]]
    - Não vamos nos aprofundar nisso na disciplina!

** TLA+ REPL
- O TLA+ tem uma REPL que só funciona para expressões constantes
  - Não podemos usar ela para definir variáveis e avaliar transições
- Só está disponível na pre-release do TLA+, então
  - No VSCode, precisamos da extensão versão *Nightly*
  - No =.jar=, precisamos da versão 1.8.0

#+BEAMER: \pause
#+BEAMER: \medskip
Atenção para como faremos pra rodar ela nos computadores da UDESC:
1. No VSCode, baixar a extensão: *TLA+ Nightly*
2. Aperte F1 e escolha: TLA+: Run REPL in Terminal.

** TLA+ REPL em qualquer terminal
Opção 1 (com ou sem =sudo=, somente UNIX):
- [[https://github.com/pmer/tla-bin]]
- Instalar:
  #+begin_src sh
  git clone https://github.com/pmer/tla-bin.git
  cd tla-bin
  sh download_or_update_tla.sh --nightly
  sh install.sh ~/.local
  # ou, se tiver sudo:
  sudo install.sh
  #+end_src
- Executar:
  #+begin_src sh
  cd ~/.local/bin
  ./tlarepl
  #+end_src
#+BEAMER: \end{frame}
#+BEAMER: \begin{frame}[fragile]{TLA+ REPL em qualquer terminal II}
Opção 2 (sem =sudo)=:
1. Baixar o =tla2tools.jar= versão 1.8.0. Duas opções:
   - Do GitHub: [[https://github.com/tlaplus/tlaplus/releases/download/v1.8.0/tla2tools.jar]]
   - Ou, se você já instalou a extensão do VSCode, esse arquivo já existe em =~/.vscode/extensions/alygin.vscode-tlaplus-nightly-<versao>/tools/tla2tools.jar=
2. Executar o =jar=:
   =java -cp tla2tools.jar tlc2.REPL=

#+BEAMER: \pause
#+BEAMER: \medskip
Opção 3 (com =sudo=):
  - Seguir as instruções em [[https://lamport.azurewebsites.net/tla/standalone-tools.html]]
  - Executar com =java tlc2.REPL=

** Constantes e variáveis
Em Quint:
#+begin_src quint
const MY_CONST: int

var x: str
var y: bool
#+end_src

#+BEAMER: \medskip
Em TLA+:
#+begin_src tla
CONSTANT MY_CONST
VARIABLES x, y
#+end_src

#+BEAMER: \medskip
Temos as palavras-chave: =CONSTANT=, =CONSTANTS=, =VARIABLE= e =VARIABLES=.

** Instanciando módulos
Lembram nos semáforos, quando tínhamos a constante =SEMAFOROS=, e instanciávamos o módulo com:
#+begin_src quint
module semaforos_3 {
  import semaforos(SEMAFOROS=Set(0, 1, 2)).*
}
#+end_src

#+BEAMER: \medskip
Em TLA+, usaríamos o =INSTANCE=:
#+begin_src tla
INSTANCE semaforos WITH SEMAFOROS <- {0, 1 ,2}
#+end_src

#+BEAMER: \pause
#+BEAMER: \medskip
Inclusive, em TLA+ podemos atribuir *variáveis* nas instâncias também, o que não é permitido em Quint.

#+BEAMER: \pause
#+BEAMER: \medskip
PS: Constantes e Instâncias são um tanto complicadas. A utilização delas nos trabalhos da disciplina é totalmente opcional.

