docs/mfo/20240331223036-mfo_introducao_ao_tla.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="description" content="Personal homepage exported with org-thtml">

  <title>Introdução ao TLA+</title>
  <link rel="icon" type="image/x-icon" href="/images/favicon.ico">

  <meta property="og:url" content="https://bugarela.com/mfo/20240331223036-mfo_introducao_ao_tla.html" />
  <meta property="og:title" content="Introdução ao TLA+" />
  <meta property="og:type" content="article" />
  <meta property="og:description" content="Personal homepage exported with org-thtml" />
  
  
    <meta name="twitter:card" content="summary_large_image">
    <meta name="twitter:site" content="@bugarela">
    <meta name="twitter:title" content="Introdução ao TLA+">
    <meta name="twitter:description" content="Personal homepage exported with org-thtml">
  

<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/pure/1.0.1/pure-min.css">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.5.1/css/all.min.css">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/pure/1.0.1/grids-responsive-min.css">
<link rel="stylesheet" href="../css/layouts/style.css">

  </head>
  <body>
    <div id="layout" class="pure-g">
      <div class="sidebar pure-u-1 pure-u-md-1-3">
  <div class="pure-g">
    <div class="pure-u-1 pure-u-lg-1-2">
    </div>
    <div class="pure-u-1 pure-u-lg-1-2">
      <div class="header">
        <h2 class="brand-title"><a href="../"><i class="fas fa-home"></i> Gabriela Moreira</a></h2>
      </div>
      <div class="centered">
        <h1 class="huge"><i class="fas fa-folder-open"></i></h1>
        <h1 class="huge"><a href="./">MFO</a></h1>
        <h2 class="brand-title">Métodos Formais</h2>
        <h2 class="brand-tagline">Materiais da disciplina</h2>
      </div>
      <div class="footer">
  <div>Created using Emacs and <a href="https://github.com/juanjosegarciaripoll/org-thtml">org-mode</a></div>
</div>

    </div>
  </div>
</div>

      <div class="content pure-u-1 pure-u-md-2-3">
        <h2>Introdução ao TLA+</h2>
        <a href="https://bugarela.com/mfo/slides/20240331223036-mfo_introducao_ao_tla.pdf">Slides</a><br />
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#quint-tla-1">1. Quint -&gt; TLA+</a>
<ul>
<li><a href="#quint-tla-2">1.1. Quint -&gt; TLA+</a></li>
<li><a href="#tipos-2">1.2. Tipos</a></li>
<li><a href="#tla-repl-2">1.3. TLA+ REPL</a></li>
<li><a href="#tla-repl-em-qualquer-terminal-2">1.4. TLA+ REPL em qualquer terminal</a></li>
<li><a href="#constantes-e-vari-veis-2">1.5. Constantes e variáveis</a></li>
<li><a href="#instanciando-m-dulos-2">1.6. Instanciando módulos</a></li>
<li><a href="#imports-2">1.7. Imports</a></li>
<li><a href="#literais-2">1.8. Literais</a></li>
<li><a href="#lambdas-operadores-an-nimos-2">1.9. Lambdas (Operadores Anônimos)</a></li>
<li><a href="#let-in-2">1.10. LET &#x2026; IN &#x2026;</a></li>
<li><a href="#conjun-o-e-disjun-o-2">1.11. Conjunção e Disjunção</a></li>
<li><a href="#condicional-2">1.12. Condicional</a></li>
<li><a href="#sets-2">1.13. Sets!</a></li>
<li><a href="#operadores-sobre-sets-2">1.14. Operadores sobre sets</a></li>
<li><a href="#n-o-determinismo-2">1.15. Não-determinismo</a></li>
<li><a href="#exerc-cios-sets-2">1.16. Exercícios Sets</a></li>
<li><a href="#maps-2">1.17. Maps</a></li>
<li><a href="#maps-construtor-2">1.18. Maps - construtor</a></li>
<li><a href="#maps-construtor-como-em-quint-2">1.19. Maps - construtor como em Quint</a></li>
<li><a href="#maps-acesso-2">1.20. Maps - acesso</a></li>
<li><a href="#operadores-sobre-maps-2">1.21. Operadores sobre Maps</a></li>
<li><a href="#records-2">1.22. Records</a></li>
<li><a href="#listas-ou-sequ-ncias-2">1.23. Listas (ou Sequências)</a></li>
<li><a href="#tuplas-2">1.24. Tuplas</a></li>
<li><a href="#unchanged-2">1.25. Unchanged</a></li>
<li><a href="#folds-2">1.26. Folds</a></li>
<li><a href="#exerc-cios-fold-2">1.27. Exercícios Fold</a></li>
<li><a href="#exerc-cios-tla-2">1.28. Exercícios TLA+</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-quint-tla-1" class="outline-2">
<h2 id="quint-tla-1"><span class="section-number-2">1.</span> Quint -&gt; TLA+</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-quint-tla-2" class="outline-3">
<h3 id="quint-tla-2"><span class="section-number-3">1.1.</span> Quint -&gt; TLA+</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Já aprendemos Quint, então vamos ver TLA+ pensando nas equivalencias com Quint.<br />
</p>
<ul class="org-ul">
<li>O próprio <a href="https://github.com/informalsystems/quint/blob/main/doc/lang.md">Manual do Quint</a> trás essas comparações entra TLA+ e Quint<br /></li>
</ul>
</div>
</div>
<div id="outline-container-tipos-2" class="outline-3">
<h3 id="tipos-2"><span class="section-number-3">1.2.</span> Tipos</h3>
<div class="outline-text-3" id="text-1-2">
<p>
TLA+ não tem tipos!<br />
</p>
<ul class="org-ul">
<li>No TLC, erros de tipo serão detectados em runtime<br />
<ul class="org-ul">
<li>Se seu modelo tiver <code>1 + "bla"</code> no sétimo estado da execução, o TLC só vai perceber o problema quando chegar nesse estado em sua exploração<br /></li>
</ul></li>
</ul>
<ul class="org-ul">
<li>No Apalache, é preciso traduzir o modelo para fórmulas SMT, que precisam ser tipadas<br />
<ul class="org-ul">
<li>TLA+ para o Apalache é tipado<br /></li>
<li><p>
A linguagem em si não é tipada, mas o Apalache espera que os tipos sejam anotados nos comentários<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">    <span style="color: #66a4a4;">VARIABLES</span>
      <span style="color: #C18E76;">\* @type: Int -&gt; Int;</span>
      clock,
      <span style="color: #C18E76;">\* @type: Int -&gt; (Int -&gt; Int);</span>
      req,
      <span style="color: #C18E76;">\* @type: Int -&gt; Set(Int);</span>
      ack,
</pre>
</div></li>
<li>Mais informações no <a href="https://apalache.informal.systems/docs/tutorials/snowcat-tutorial.html">Manual do Apalache</a><br />
<ul class="org-ul">
<li>Não vamos nos aprofundar nisso na disciplina!<br /></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-tla-repl-2" class="outline-3">
<h3 id="tla-repl-2"><span class="section-number-3">1.3.</span> TLA+ REPL</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>O TLA+ tem uma REPL que só funciona para expressões constantes<br />
<ul class="org-ul">
<li>Não podemos usar ela para definir variáveis e avaliar transições<br /></li>
</ul></li>
<li>Só está disponível na pre-release do TLA+, então<br />
<ul class="org-ul">
<li>No VSCode, precisamos da extensão versão <b>Nightly</b><br /></li>
<li>No <code>.jar</code>, precisamos da versão 1.8.0<br /></li>
</ul></li>
</ul>

<p>
Atenção para como faremos pra rodar ela nos computadores da UDESC:<br />
</p>
<ol class="org-ol">
<li>No VSCode, baixar a extensão: <b>TLA+ Nightly</b><br /></li>
<li>Aperte F1 e escolha: TLA+: Run REPL in Terminal.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-tla-repl-em-qualquer-terminal-2" class="outline-3">
<h3 id="tla-repl-em-qualquer-terminal-2"><span class="section-number-3">1.4.</span> TLA+ REPL em qualquer terminal</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Opção 1 (com ou sem <code>sudo</code>, somente UNIX):<br />
</p>
<ul class="org-ul">
<li><a href="https://github.com/pmer/tla-bin">https://github.com/pmer/tla-bin</a><br /></li>
<li><p>
Instalar:<br />
</p>
<div class="org-src-container">
<pre class="src src-sh">  <span style="color: #d79921;">git</span> clone https://github.com/pmer/tla-bin.git
  <span style="color: #d79921;">cd</span> tla-bin
  sh download_or_update_tla.sh --nightly
  sh install.sh ~/.local
  <span style="color: #C18E76;"># </span><span style="color: #C18E76;">ou, se tiver sudo:</span>
  <span style="color: #d79921;">sudo</span> install.sh
</pre>
</div></li>
<li><p>
Executar:<br />
</p>
<div class="org-src-container">
<pre class="src src-sh">  <span style="color: #d79921;">cd</span> ~/.local/bin
  ./tlarepl
</pre>
</div></li>
</ul>
<p>
Opção 2 (sem <code>sudo)</code>:<br />
</p>
<ol class="org-ol">
<li>Baixar o <code>tla2tools.jar</code> versão 1.8.0. Duas opções:<br />
<ul class="org-ul">
<li>Do GitHub: <a href="https://github.com/tlaplus/tlaplus/releases/download/v1.8.0/tla2tools.jar">https://github.com/tlaplus/tlaplus/releases/download/v1.8.0/tla2tools.jar</a><br /></li>
<li>Ou, se você já instalou a extensão do VSCode, esse arquivo já existe em <code>~/.vscode/extensions/alygin.vscode-tlaplus-nightly-&lt;versao&gt;/tools/tla2tools.jar</code><br /></li>
</ul></li>
<li>Executar o <code>jar</code>:<br />
<code>java -cp tla2tools.jar tlc2.REPL</code><br /></li>
</ol>

<p>
Opção 3 (com <code>sudo</code>):<br />
</p>
<ul class="org-ul">
<li>Seguir as instruções em <a href="https://lamport.azurewebsites.net/tla/standalone-tools.html">https://lamport.azurewebsites.net/tla/standalone-tools.html</a><br /></li>
<li>Executar com <code>java tlc2.REPL</code><br /></li>
</ul>
</div>
</div>
<div id="outline-container-constantes-e-vari-veis-2" class="outline-3">
<h3 id="constantes-e-vari-veis-2"><span class="section-number-3">1.5.</span> Constantes e variáveis</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Em Quint:<br />
</p>
<div class="org-src-container">
<pre class="src src-quint"><span style="color: #e35b15;">const</span> MY_CONST: <span style="color: #d79921;">int</span>

<span style="color: #e35b15;">var</span> x: <span style="color: #d79921;">str</span>
<span style="color: #e35b15;">var</span> y: <span style="color: #d79921;">bool</span>
</pre>
</div>

<p>
Em TLA+:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla"><span style="color: #66a4a4;">CONSTANT</span> MY_CONST
<span style="color: #66a4a4;">VARIABLES</span> x, y
</pre>
</div>

<p>
Temos as palavras-chave: <code>CONSTANT</code>, <code>CONSTANTS</code>, <code>VARIABLE</code> e <code>VARIABLES</code>.<br />
</p>
</div>
</div>
<div id="outline-container-instanciando-m-dulos-2" class="outline-3">
<h3 id="instanciando-m-dulos-2"><span class="section-number-3">1.6.</span> Instanciando módulos</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Lembram nos semáforos, quando tínhamos a constante <code>SEMAFOROS</code>, e instanciávamos o módulo com:<br />
</p>
<div class="org-src-container">
<pre class="src src-quint"><span style="color: #e35b15;">module</span> semaforos_3 {
  <span style="color: #e35b15;">import</span> semaforos(SEMAFOROS=Set(0, 1, 2)).*
}
</pre>
</div>

<p>
Em TLA+, usaríamos o <code>INSTANCE</code>:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla"><span style="color: #66a4a4;">INSTANCE</span> semaforos <span style="color: #66a4a4;">WITH</span> SEMAFOROS &lt;- {<span style="color: #d79921; font-weight: bold;">0</span>, <span style="color: #d79921; font-weight: bold;">1</span> ,<span style="color: #d79921; font-weight: bold;">2</span>}
</pre>
</div>

<p>
Inclusive, em TLA+ podemos atribuir <b>variáveis</b> nas instâncias também, o que não é permitido em Quint.<br />
</p>

<p>
PS: Constantes e Instâncias são um tanto complicadas. A utilização delas nos trabalhos da disciplina é totalmente opcional.<br />
</p>
</div>
</div>
