mfo/20240331223036-mfo_introducao_ao_tla.org
** Imports
Em Quint, tempos os imports
#+begin_src quint
import meu_modulo.*
import meu_modulo.minha_definicao
import meu_modulo as M
#+end_src

#+BEAMER: \medskip
Em TLA+
#+begin_src tla
EXTENDS meu_modulo
#+end_src

#+BEAMER: \pause
#+BEAMER: \medskip
Inclusive, os interios não são /built-in/ em TLA+. Temos que importar o módulo de inteiros com
#+begin_src tla
EXTENDS Integers
#+end_src

** Literais
- =false= em Quint é =FALSE= em TLA+
- =true= em Quint é =TRUE= em TLA+
- inteiros e strings são a mesma coisa
  - Divisão de inteiros é feita com =\div=

** Lambdas (Operadores Anônimos)
Em Quint, temos lambdas como o a seguir. Contudo (por hora), lambdas só podem ser usados como argumentos pra outros operadores, como para o =map= e =fold=:
#+begin_src quint
my_set.map(x => x + 1)
my_set.fold(0, (acc, i) => acc + i)
#+end_src

#+BEAMER: \medskip
Em TLA+, temos lambdas, de forma geral, como:
#+begin_src tla
LAMBDA x: x + 1
LAMBDA x, y: x + y
#+end_src

** LET ... IN ...
Em Quint, podemos declarar varios operadores seguidos de uma expressão:
#+begin_src quint
pure val a = {
  pure val b = 1
  pure val c = b + 1
  c + 1
}
#+end_src

Em TLA+, fazemos o semelhante com:
#+begin_src tla
a == LET b == 1
         c == b + 1
      IN c + 1
#+end_src

#+BEAMER: \pause
Percebam que usamos duplo ===  (====) para definições. Para o predicado de igualdade, usamos um único ===, diferente de linguagens de programação. Basicamente, o oposto de Quint.
** Conjunção e Disjunção
*** Conjunção
:PROPERTIES:
:BEAMER_col: 0.5
:END:
Conjunção em Quint:
#+begin_src quint
pure val pred = a and b
action conj = all {
  A,
  B,
  C,
}
#+end_src

Conjunção em TLA+:
#+begin_src tla
pred == a /\ b
conj ==
   /\ A
   /\ B
   /\ C
#+end_src

*** Disjunção
:PROPERTIES:
:BEAMER_col: 0.5
:END:
Disjunção em Quint:
#+begin_src quint
pure val pred = a or b
action disj = any {
  A,
  B,
  C,
}
#+end_src

Disjunção em TLA+:
#+begin_src tla
pred == a \/ b
conj ==
   \/ A
   \/ B
   \/ C
#+end_src

** Condicional
Em Quint:
#+begin_src quint
pure def f(x) = if (x == 0) 10 else 20
#+end_src

Em TLA+:
#+begin_src tla
f(x) == IF x = 0 THEN 10 ELSE 20
#+end_src

** Sets!
Em Quint:
#+begin_src quint
Set(1, 2, 3)
#+end_src

#+BEAMER: \medskip
Em TLA+:
#+begin_src tla
{1, 2, 3}
#+end_src

** Operadores sobre sets

Existe e para todo:
#+begin_src tla
\E x \in S: P \* S.exists(x => P)
\A x \in S: P \* S.forall(x => P)
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
=map= e =filter=:
#+begin_src tla
{ e: x \in S } \* S.map(x => e)
{ x \in S: P } \* S.filter(x => P)
#+end_src
#+BEAMER: \end{frame}
#+BEAMER: \begin{frame}[fragile]{Operadores sobre sets II}
Predicados:
#+begin_src tla
e \in S \* e.in(S) ou S.contains(e)
S \union T \* S.union(T)
S \intersect T \* S.intersect(T)
S \ T \* S.exclude(T)
S \subseteq T \* S.subseteq(T)
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
Outros operadores:
#+begin_src tla
SUBSET S \* S.powerset()
UNION S \* S.flatten()
Cardinality(S) \* S.size()
a..b \* a.to(b)
#+end_src

#+BEAMER: \medskip
PS: Para usar =Cardinality=, precisamos fazer =EXTENDS FiniteSets=

** Não-determinismo
Em Quint:
#+begin_src quint
nondet name = my_set.oneOf()
x' = name
#+end_src

#+BEAMER: \medskip
Em TLA+, é apenas um /exists/ normal:
#+begin_src tla
\E name \in my_set: x' = name
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
Lembrando que o equivalente ao /exists/ (=my_set.exists(name => x' = name)=) não é permitido em Quint, pois não podemos usar *ações* como argumentos do =exists=.

** Exercícios Sets
Resolva usando os equivalentes a =map= e =filter= na REPL:
1. Dado um conjunto de números, retorne um conjunto do quadrado desses números.
  #+begin_src tla
LET quadrado(S) == resolucao IN quadrado({1, 2, 3, 4})
  #+end_src
2. Dado um conjunto de números, retorne um conjunto apenas com os números pares.
  #+begin_src tla
LET pares(S) == resolucao IN pares({1, 2, 3, 4})
  #+end_src

** Maps
- Chamados funções em TLA+, mas podemos continuar chamando de mapas para não confundir.
- Contudo, a perspectiva aqui é a de funções. Não temos uma boa forma de expressar um mapa que começa vazio e vai crescendo conforme o sistema evolui.
  - Geralmente inicializamos o mapa com as chaves já definidas, e algum valor inicial.
  - Isso é uma boa prática para Quint também!

