docs/mfo/20240331223036-mfo_introducao_ao_tla.html
<div id="outline-container-imports-2" class="outline-3">
<h3 id="imports-2"><span class="section-number-3">1.7.</span> Imports</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Em Quint, tempos os imports<br />
</p>
<div class="org-src-container">
<pre class="src src-quint"><span style="color: #e35b15;">import</span> meu_modulo.*
<span style="color: #e35b15;">import</span> meu_modulo.minha_definicao
<span style="color: #e35b15;">import</span> meu_modulo <span style="color: #e35b15;">as</span> M
</pre>
</div>

<p>
Em TLA+<br />
</p>
<div class="org-src-container">
<pre class="src src-tla"><span style="color: #66a4a4;">EXTENDS</span> meu_modulo
</pre>
</div>

<p>
Inclusive, os interios não são <i>built-in</i> em TLA+. Temos que importar o módulo de inteiros com<br />
</p>
<div class="org-src-container">
<pre class="src src-tla"><span style="color: #66a4a4;">EXTENDS</span> Integers
</pre>
</div>
</div>
</div>
<div id="outline-container-literais-2" class="outline-3">
<h3 id="literais-2"><span class="section-number-3">1.8.</span> Literais</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li><code>false</code> em Quint é <code>FALSE</code> em TLA+<br /></li>
<li><code>true</code> em Quint é <code>TRUE</code> em TLA+<br /></li>
<li>inteiros e strings são a mesma coisa<br />
<ul class="org-ul">
<li>Divisão de inteiros é feita com <code>\div</code><br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-lambdas-operadores-an-nimos-2" class="outline-3">
<h3 id="lambdas-operadores-an-nimos-2"><span class="section-number-3">1.9.</span> Lambdas (Operadores Anônimos)</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Em Quint, temos lambdas como o a seguir. Contudo (por hora), lambdas só podem ser usados como argumentos pra outros operadores, como para o <code>map</code> e <code>fold</code>:<br />
</p>
<div class="org-src-container">
<pre class="src src-quint">my_set.map(x =&gt; x + 1)
my_set.fold(0, (acc, i) =&gt; acc + i)
</pre>
</div>

<p>
Em TLA+, temos lambdas, de forma geral, como:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla"><span style="color: #66a4a4;">LAMBDA</span> x: x + <span style="color: #d79921; font-weight: bold;">1</span>
<span style="color: #66a4a4;">LAMBDA</span> x, y: x + y
</pre>
</div>
</div>
</div>
<div id="outline-container-let-in-2" class="outline-3">
<h3 id="let-in-2"><span class="section-number-3">1.10.</span> LET &#x2026; IN &#x2026;</h3>
<div class="outline-text-3" id="text-1-10">
<p>
Em Quint, podemos declarar varios operadores seguidos de uma expressão:<br />
</p>
<div class="org-src-container">
<pre class="src src-quint"><span style="color: #e35b15;">pure</span> <span style="color: #e35b15;">val</span> a = {
  <span style="color: #e35b15;">pure</span> <span style="color: #e35b15;">val</span> b = 1
  <span style="color: #e35b15;">pure</span> <span style="color: #e35b15;">val</span> c = b + 1
  c + 1
}
</pre>
</div>

<p>
Em TLA+, fazemos o semelhante com:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">a == <span style="color: #66a4a4;">LET</span> b == <span style="color: #d79921; font-weight: bold;">1</span>
         c == b + <span style="color: #d79921; font-weight: bold;">1</span>
      <span style="color: #66a4a4;">IN</span> c + <span style="color: #d79921; font-weight: bold;">1</span>
</pre>
</div>

<p>
Percebam que usamos duplo <code>=</code>  (<code>==</code>) para definições. Para o predicado de igualdade, usamos um único <code>=</code>, diferente de linguagens de programação. Basicamente, o oposto de Quint.<br />
</p>
</div>
</div>
<div id="outline-container-conjun-o-e-disjun-o-2" class="outline-3">
<h3 id="conjun-o-e-disjun-o-2"><span class="section-number-3">1.11.</span> Conjunção e Disjunção</h3>
<div class="outline-text-3" id="text-1-11">
</div>
<ol class="org-ol">
<li><a id="conjun-o-3"></a>Conjunção<br />
<div class="outline-text-4" id="text-1-11-1">
<p>
Conjunção em Quint:<br />
</p>
<div class="org-src-container">
<pre class="src src-quint"><span style="color: #e35b15;">pure</span> <span style="color: #e35b15;">val</span> pred = a <span style="color: #66a4a4;">and</span> b
<span style="color: #e35b15;">action</span> conj = <span style="color: #66a4a4;">all</span> {
  A,
  B,
  C,
}
</pre>
</div>

<p>
Conjunção em TLA+:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">pred == a /\ b
conj ==
   /\ A
   /\ B
   /\ C
</pre>
</div>
</div>
</li>
<li><a id="disjun-o-3"></a>Disjunção<br />
<div class="outline-text-4" id="text-1-11-2">
<p>
Disjunção em Quint:<br />
</p>
<div class="org-src-container">
<pre class="src src-quint"><span style="color: #e35b15;">pure</span> <span style="color: #e35b15;">val</span> pred = a <span style="color: #66a4a4;">or</span> b
<span style="color: #e35b15;">action</span> disj = <span style="color: #66a4a4;">any</span> {
  A,
  B,
  C,
}
</pre>
</div>

<p>
Disjunção em TLA+:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">pred == a \/ b
conj ==
   \/ A
   \/ B
   \/ C
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-condicional-2" class="outline-3">
<h3 id="condicional-2"><span class="section-number-3">1.12.</span> Condicional</h3>
<div class="outline-text-3" id="text-1-12">
<p>
Em Quint:<br />
</p>
<div class="org-src-container">
<pre class="src src-quint"><span style="color: #e35b15;">pure</span> <span style="color: #e35b15;">def</span> f(x) = <span style="color: #66a4a4;">if</span> (x == 0) 10 <span style="color: #66a4a4;">else</span> 20
</pre>
</div>

<p>
Em TLA+:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">f(x) == <span style="color: #66a4a4;">IF</span> x = <span style="color: #d79921; font-weight: bold;">0</span> <span style="color: #66a4a4;">THEN</span> <span style="color: #d79921; font-weight: bold;">10</span> <span style="color: #66a4a4;">ELSE</span> <span style="color: #d79921; font-weight: bold;">20</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sets-2" class="outline-3">
<h3 id="sets-2"><span class="section-number-3">1.13.</span> Sets!</h3>
<div class="outline-text-3" id="text-1-13">
<p>
Em Quint:<br />
</p>
<div class="org-src-container">
<pre class="src src-quint"><span style="color: #d79921;">Set</span>(1, 2, 3)
</pre>
</div>

<p>
Em TLA+:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">{<span style="color: #d79921; font-weight: bold;">1</span>, <span style="color: #d79921; font-weight: bold;">2</span>, <span style="color: #d79921; font-weight: bold;">3</span>}
</pre>
</div>
</div>
</div>
<div id="outline-container-operadores-sobre-sets-2" class="outline-3">
<h3 id="operadores-sobre-sets-2"><span class="section-number-3">1.14.</span> Operadores sobre sets</h3>
<div class="outline-text-3" id="text-1-14">
<p>
Existe e para todo:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">\E x \in S: P <span style="color: #C18E76;">\* S.exists(x =&gt; P)</span>
\A x \in S: P <span style="color: #C18E76;">\* S.forall(x =&gt; P)</span>
</pre>
</div>

<p>
<code>map</code> e <code>filter</code>:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">{ e: x \in S } <span style="color: #C18E76;">\* S.map(x =&gt; e)</span>
{ x \in S: P } <span style="color: #C18E76;">\* S.filter(x =&gt; P)</span>
</pre>
</div>
<p>
Predicados:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">e \in S <span style="color: #C18E76;">\* e.in(S) ou S.contains(e)</span>
S \union T <span style="color: #C18E76;">\* S.union(T)</span>
S \intersect T <span style="color: #C18E76;">\* S.intersect(T)</span>
S \ T <span style="color: #C18E76;">\* S.exclude(T)</span>
S \subseteq T <span style="color: #C18E76;">\* S.subseteq(T)</span>
</pre>
</div>

<p>
Outros operadores:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla"><span style="color: #66a4a4;">SUBSET</span> S <span style="color: #C18E76;">\* S.powerset()</span>
<span style="color: #66a4a4;">UNION</span> S <span style="color: #C18E76;">\* S.flatten()</span>
Cardinality(S) <span style="color: #C18E76;">\* S.size()</span>
a..b <span style="color: #C18E76;">\* a.to(b)</span>
</pre>
</div>

<p>
PS: Para usar <code>Cardinality</code>, precisamos fazer <code>EXTENDS FiniteSets</code><br />
</p>
</div>
</div>
<div id="outline-container-n-o-determinismo-2" class="outline-3">
<h3 id="n-o-determinismo-2"><span class="section-number-3">1.15.</span> Não-determinismo</h3>
<div class="outline-text-3" id="text-1-15">
<p>
Em Quint:<br />
</p>
<div class="org-src-container">
<pre class="src src-quint"><span style="color: #e35b15;">nondet</span> name = my_set.oneOf()
x' = name
</pre>
</div>

<p>
Em TLA+, é apenas um <i>exists</i> normal:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">\E name \in my_set: x' = name
</pre>
</div>

<p>
Lembrando que o equivalente ao <i>exists</i> (<code>my_set.exists(name =&gt; x' = name)</code>) não é permitido em Quint, pois não podemos usar <b>ações</b> como argumentos do <code>exists</code>.<br />
</p>
</div>
</div>
<div id="outline-container-exerc-cios-sets-2" class="outline-3">
<h3 id="exerc-cios-sets-2"><span class="section-number-3">1.16.</span> Exercícios Sets</h3>
<div class="outline-text-3" id="text-1-16">
<p>
Resolva usando os equivalentes a <code>map</code> e <code>filter</code> na REPL:<br />
</p>
<ol class="org-ol">
<li><p>
Dado um conjunto de números, retorne um conjunto do quadrado desses números.<br />
</p>
<div class="org-src-container">
<pre class="src src-tla"><span style="color: #66a4a4;">LET</span> quadrado(S) == resolucao <span style="color: #66a4a4;">IN</span> quadrado({<span style="color: #d79921; font-weight: bold;">1</span>, <span style="color: #d79921; font-weight: bold;">2</span>, <span style="color: #d79921; font-weight: bold;">3</span>, <span style="color: #d79921; font-weight: bold;">4</span>})
</pre>
</div></li>
<li><p>
Dado um conjunto de números, retorne um conjunto apenas com os números pares.<br />
</p>
<div class="org-src-container">
<pre class="src src-tla"><span style="color: #66a4a4;">LET</span> pares(S) == resolucao <span style="color: #66a4a4;">IN</span> pares({<span style="color: #d79921; font-weight: bold;">1</span>, <span style="color: #d79921; font-weight: bold;">2</span>, <span style="color: #d79921; font-weight: bold;">3</span>, <span style="color: #d79921; font-weight: bold;">4</span>})
</pre>
</div></li>
</ol>
</div>
</div>
<div id="outline-container-maps-2" class="outline-3">
<h3 id="maps-2"><span class="section-number-3">1.17.</span> Maps</h3>
<div class="outline-text-3" id="text-1-17">
<ul class="org-ul">
<li>Chamados funções em TLA+, mas podemos continuar chamando de mapas para não confundir.<br /></li>
<li>Contudo, a perspectiva aqui é a de funções. Não temos uma boa forma de expressar um mapa que começa vazio e vai crescendo conforme o sistema evolui.<br />
<ul class="org-ul">
<li>Geralmente inicializamos o mapa com as chaves já definidas, e algum valor inicial.<br /></li>
<li>Isso é uma boa prática para Quint também!<br /></li>
</ul></li>
</ul>
</div>
</div>
