mfo/20240331223036-mfo_introducao_ao_tla.org
** Maps - construtor

#+BEAMER: \medskip
Em Quint:
#+begin_src quint
S.mapBy(x => e)
#+end_src

#+BEAMER: \medskip
Em TLA+:
#+begin_src tla
[ x \in S |-> e ]
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
Por exemplo, criando uma estrutura para guardar o saldo no banco de cada pessoa:
#+begin_src tla
[ pessoa \in { "alice", "bob", "charlie" } |-> 0 ]
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
Se eu ainda não souber quem são as pessoas, aí sim preciso criar um mapa vazio:
#+begin_src tla
[ pessoa \in {} |-> 0 ]
#+end_src

** Maps - construtor como em Quint
O equivalente a:
#+begin_src quint
Map(k_1 -> v_1, k_2 -> v_2, k_3 -> v_3)
#+end_src

seria:
#+begin_src tla
[ x \in { a: <<a, b>> \in S } |-> (CHOOSE p \in S: p[1] = x)[2]]
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
O =CHOOSE= é um operador um tanto complicado
  - Ele parece não determinístico, mas é completamente determinístico
  - Vamos evitar ele por agora. Talvez voltamos nisso no final da disciplina.

#+BEAMER: \end{frame}
#+BEAMER: \begin{frame}[fragile]{Maps - construtor como em Quint II}

Solução: =SetAsFun=

#+BEAMER: \medskip
#+BEAMER: \pause
Podemos copiar o operador =SetAsFun= do Apalache e usá-lo. Primeiro, copie e cole a seguinte definição
#+begin_src tla
SetAsFun(S) ==
    LET Dom == { x: <<x, y>> \in S }
        Rng == { y: <<x, y>> \in S }
    IN
    [ x \in Dom |-> CHOOSE y \in Rng: <<x, y>> \in S ]
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
E para utilizar, basta fornecer um conjundo de duplas do tipo <<chave, valor>> como parâmetro:
#+begin_src tla
MeuMapa == SetAsFun({ <<k_1, v_1>>, <<k_2, v_2>>, <<k_3, v_3>> })
#+end_src

** Maps - acesso
Para acessar uma chave =e= de um mapa =f=:
#+begin_src tla
f[e] \* f.get(e)
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
Um exemplo na REPL.
  - PS: A REPL de TLA+ imprime somente os valores de um mapa quando imprime um mapa.
#+begin_src tla
(tla+) [ x \in {1, 2} |-> x + 1 ]
\* <<2, 3>>
(tla+) LET m == [ x \in {1, 2} |-> x + 1 ] IN m[1]
\* 2
#+end_src

** Operadores sobre Maps
Obtendo o conjunto com as chaves:
#+begin_src tla
DOMAIN f \* f.keys()
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
Obtendo todos os mapas possíveis:
#+begin_src tla
[ S -> T ] \* setOfMaps(S, T)
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
Atualizando e adicionando valores:
#+begin_src tla
[f EXCEPT ![e1] = e2] \* f.set(e1, e2)
[f EXCEPT ![e1] = e2, ![e3] = e4]
\* f.set(e1, e2).set(e3, e4)
[f EXCEPT ![e1] = @ + y]
\* f.setBy(e1, (old => old + y))
(k :> v) @@ f \* f.put(k, v)
#+end_src

** Records
Construtor:
#+begin_src tla
[ f_1 |-> e_1, ..., f_n |-> e_n ]
\* { f_1: e_1, ..., f_n: e_n }
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
Acesso, idêntico ao Quint:
#+begin_src tla
r.meu_campo \* r.meu_campo
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
Atualização:
#+begin_src tla
[r EXCEPT !.f = e]
\* r.with("f", e) ou  { ...r, f: e }
[r EXCEPT !.f1 = e1, !fN = eN] \* N campos
#+end_src
#+BEAMER: \end{frame}
#+BEAMER: \begin{frame}[fragile]{Records II}
Obtendo todos os possíveis records:
#+begin_src tla
[ f_1: S_1, ..., f_n: S_n ]
\* tuples(S_1, ..., S_n).map(((a_1, ..., a_n)) => { f_1: a_1, ..., f_n: a_n })
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
Obtendo os nomes dos campos:
#+begin_src tla
DOMAIN r \* r.fieldNames()
#+end_src

** Listas (ou Sequências)
Construtor:
#+begin_src tla
<<e_1, ..., e_n>> \* [ e_1, ..., e_n ]
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
Acesso, sendo que os índices iniciam em 1:
#+begin_src tla
s[i] \* l[i - 1]
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
Atualização em um índice:
#+begin_src tla
[ s EXCEPT ![i] = e ] \* l.replaceAt(i - 1, e)
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
Adicionando elementos:
#+begin_src tla
Append(s, e) \* l.append(e)
l \circ t \* l.concat(t)
#+end_src
#+BEAMER: \end{frame}
#+BEAMER: \begin{frame}[fragile]{Listas II}
Outros operadores:
#+begin_src tla
Head(l) \* l.head()
Tail(l) \* l.tail()
Len(s) \* l.length()
DOMAIN  i \* l.indices().map(i => i - 1)
SubSeq(lst, start, end) \* l.slice(start - 1, end)
SelectSeq(s, Test) \* select(l, Test)
#+end_src

** Tuplas
Já que não temos tipos em TLA+, tuplas são nada mais do que uma lista.
 - elementos podem ter tipos distintos em ambas (heterogenindade).

#+BEAMER: \medskip
#+BEAMER: \pause
 Construtor:
#+begin_src tla
<< e_1, ..., e_n >> \* (e_1, ..., e_n)
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
Acesso:
#+begin_src tla
t[1], t[2], ... , t[50] \* t._1, t._2, ..., t._50
#+end_src

#+BEAMER: \medskip
#+BEAMER: \pause
Obtendo todas as possíveis tuplas:
#+begin_src tla
S_1 \X S_2 \X ... \X S_n \* tuples(S_1, S_2, ..., S_n)
#+end_src

** Unchanged
TLA+ fornece um operador para o caso especial onde uma variável se mantém com o mesmo valor em uma ação:

#+BEAMER: \medskip
#+BEAMER: \pause
Ao invés de escrevermos:
#+begin_src tla
MinhaAcao ==
  /\ a' = a
  /\ b' = b
#+end_src

Podemos escrever:
#+begin_src tla
MinhaAcao ==
  UNCHANGED << a, b >>
#+end_src

