docs/mfo/20240331223036-mfo_introducao_ao_tla.html
<div id="outline-container-maps-construtor-2" class="outline-3">
<h3 id="maps-construtor-2"><span class="section-number-3">1.18.</span> Maps - construtor</h3>
<div class="outline-text-3" id="text-1-18">
<p>
Em Quint:<br />
</p>
<div class="org-src-container">
<pre class="src src-quint">S.mapBy(x =&gt; e)
</pre>
</div>

<p>
Em TLA+:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">[ x \in S |-&gt; e ]
</pre>
</div>

<p>
Por exemplo, criando uma estrutura para guardar o saldo no banco de cada pessoa:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">[ pessoa \in { <span style="color: #98971a;">"alice"</span>, <span style="color: #98971a;">"bob"</span>, <span style="color: #98971a;">"charlie"</span> } |-&gt; <span style="color: #d79921; font-weight: bold;">0</span> ]
</pre>
</div>

<p>
Se eu ainda não souber quem são as pessoas, aí sim preciso criar um mapa vazio:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">[ pessoa \in {} |-&gt; <span style="color: #d79921; font-weight: bold;">0</span> ]
</pre>
</div>
</div>
</div>
<div id="outline-container-maps-construtor-como-em-quint-2" class="outline-3">
<h3 id="maps-construtor-como-em-quint-2"><span class="section-number-3">1.19.</span> Maps - construtor como em Quint</h3>
<div class="outline-text-3" id="text-1-19">
<p>
O equivalente a:<br />
</p>
<div class="org-src-container">
<pre class="src src-quint">Map(k_1 -&gt; v_1, k_2 -&gt; v_2, k_3 -&gt; v_3)
</pre>
</div>

<p>
seria:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">[ x \in { a: &lt;&lt;a, b&gt;&gt; \in S } |-&gt; (<span style="color: #66a4a4;">CHOOSE</span> p \in S: p[<span style="color: #d79921; font-weight: bold;">1</span>] = x)[<span style="color: #d79921; font-weight: bold;">2</span>]]
</pre>
</div>

<p>
O <code>CHOOSE</code> é um operador um tanto complicado<br />
</p>
<ul class="org-ul">
<li>Ele parece não determinístico, mas é completamente determinístico<br /></li>
<li>Vamos evitar ele por agora. Talvez voltamos nisso no final da disciplina.<br /></li>
</ul>

<p>
Solução: <code>SetAsFun</code><br />
</p>

<p>
Podemos copiar o operador <code>SetAsFun</code> do Apalache e usá-lo. Primeiro, copie e cole a seguinte definição<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">SetAsFun(S) ==
    <span style="color: #66a4a4;">LET</span> Dom == { x: &lt;&lt;x, y&gt;&gt; \in S }
        Rng == { y: &lt;&lt;x, y&gt;&gt; \in S }
    <span style="color: #66a4a4;">IN</span>
    [ x \in Dom |-&gt; <span style="color: #66a4a4;">CHOOSE</span> y \in Rng: &lt;&lt;x, y&gt;&gt; \in S ]
</pre>
</div>

<p>
E para utilizar, basta fornecer um conjundo de duplas do tipo <a></a> como parâmetro:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">MeuMapa == SetAsFun({ &lt;&lt;k_1, v_1&gt;&gt;, &lt;&lt;k_2, v_2&gt;&gt;, &lt;&lt;k_3, v_3&gt;&gt; })
</pre>
</div>
</div>
</div>
<div id="outline-container-maps-acesso-2" class="outline-3">
<h3 id="maps-acesso-2"><span class="section-number-3">1.20.</span> Maps - acesso</h3>
<div class="outline-text-3" id="text-1-20">
<p>
Para acessar uma chave <code>e</code> de um mapa <code>f</code>:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">f[e] <span style="color: #C18E76;">\* f.get(e)</span>
</pre>
</div>

<p>
Um exemplo na REPL.<br />
</p>
<ul class="org-ul">
<li>PS: A REPL de TLA+ imprime somente os valores de um mapa quando imprime um mapa.<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-tla">(tla+) [ x \in {<span style="color: #d79921; font-weight: bold;">1</span>, <span style="color: #d79921; font-weight: bold;">2</span>} |-&gt; x + <span style="color: #d79921; font-weight: bold;">1</span> ]
<span style="color: #C18E76;">\* &lt;&lt;2, 3&gt;&gt;</span>
(tla+) <span style="color: #66a4a4;">LET</span> m == [ x \in {<span style="color: #d79921; font-weight: bold;">1</span>, <span style="color: #d79921; font-weight: bold;">2</span>} |-&gt; x + <span style="color: #d79921; font-weight: bold;">1</span> ] <span style="color: #66a4a4;">IN</span> m[<span style="color: #d79921; font-weight: bold;">1</span>]
<span style="color: #C18E76;">\* 2</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-operadores-sobre-maps-2" class="outline-3">
<h3 id="operadores-sobre-maps-2"><span class="section-number-3">1.21.</span> Operadores sobre Maps</h3>
<div class="outline-text-3" id="text-1-21">
<p>
Obtendo o conjunto com as chaves:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla"><span style="color: #66a4a4;">DOMAIN</span> f <span style="color: #C18E76;">\* f.keys()</span>
</pre>
</div>

<p>
Obtendo todos os mapas possíveis:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">[ S -&gt; T ] <span style="color: #C18E76;">\* setOfMaps(S, T)</span>
</pre>
</div>

<p>
Atualizando e adicionando valores:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">[f <span style="color: #66a4a4;">EXCEPT</span> ![e1] = e2] <span style="color: #C18E76;">\* f.set(e1, e2)</span>
[f <span style="color: #66a4a4;">EXCEPT</span> ![e1] = e2, ![e3] = e4]
<span style="color: #C18E76;">\* f.set(e1, e2).set(e3, e4)</span>
[f <span style="color: #66a4a4;">EXCEPT</span> ![e1] = @ + y]
<span style="color: #C18E76;">\* f.setBy(e1, (old =&gt; old + y))</span>
(k :&gt; v) @@ f <span style="color: #C18E76;">\* f.put(k, v)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-records-2" class="outline-3">
<h3 id="records-2"><span class="section-number-3">1.22.</span> Records</h3>
<div class="outline-text-3" id="text-1-22">
<p>
Construtor:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">[ f_1 |-&gt; e_1, ..., f_n |-&gt; e_n ]
<span style="color: #C18E76;">\* { f_1: e_1, ..., f_n: e_n }</span>
</pre>
</div>

<p>
Acesso, idêntico ao Quint:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">r.meu_campo <span style="color: #C18E76;">\* r.meu_campo</span>
</pre>
</div>

<p>
Atualização:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">[r <span style="color: #66a4a4;">EXCEPT</span> !.f = e]
<span style="color: #C18E76;">\* r.with("f", e) ou  { ...r, f: e }</span>
[r <span style="color: #66a4a4;">EXCEPT</span> !.f1 = e1, !fN = eN] <span style="color: #C18E76;">\* N campos</span>
</pre>
</div>
<p>
Obtendo todos os possíveis records:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">[ f_1: S_1, ..., f_n: S_n ]
<span style="color: #C18E76;">\* tuples(S_1, ..., S_n).map(((a_1, ..., a_n)) =&gt; { f_1: a_1, ..., f_n: a_n })</span>
</pre>
</div>

<p>
Obtendo os nomes dos campos:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla"><span style="color: #66a4a4;">DOMAIN</span> r <span style="color: #C18E76;">\* r.fieldNames()</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-listas-ou-sequ-ncias-2" class="outline-3">
<h3 id="listas-ou-sequ-ncias-2"><span class="section-number-3">1.23.</span> Listas (ou Sequências)</h3>
<div class="outline-text-3" id="text-1-23">
<p>
Construtor:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">&lt;&lt;e_1, ..., e_n&gt;&gt; <span style="color: #C18E76;">\* [ e_1, ..., e_n ]</span>
</pre>
</div>

<p>
Acesso, sendo que os índices iniciam em 1:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">s[i] <span style="color: #C18E76;">\* l[i - 1]</span>
</pre>
</div>

<p>
Atualização em um índice:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">[ s <span style="color: #66a4a4;">EXCEPT</span> ![i] = e ] <span style="color: #C18E76;">\* l.replaceAt(i - 1, e)</span>
</pre>
</div>

<p>
Adicionando elementos:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">Append(s, e) <span style="color: #C18E76;">\* l.append(e)</span>
l \circ t <span style="color: #C18E76;">\* l.concat(t)</span>
</pre>
</div>
<p>
Outros operadores:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">Head(l) <span style="color: #C18E76;">\* l.head()</span>
Tail(l) <span style="color: #C18E76;">\* l.tail()</span>
Len(s) <span style="color: #C18E76;">\* l.length()</span>
<span style="color: #66a4a4;">DOMAIN</span>  i <span style="color: #C18E76;">\* l.indices().map(i =&gt; i - 1)</span>
SubSeq(lst, start, end) <span style="color: #C18E76;">\* l.slice(start - 1, end)</span>
SelectSeq(s, Test) <span style="color: #C18E76;">\* select(l, Test)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-tuplas-2" class="outline-3">
<h3 id="tuplas-2"><span class="section-number-3">1.24.</span> Tuplas</h3>
<div class="outline-text-3" id="text-1-24">
<p>
Já que não temos tipos em TLA+, tuplas são nada mais do que uma lista.<br />
</p>
<ul class="org-ul">
<li>elementos podem ter tipos distintos em ambas (heterogenindade).<br /></li>
</ul>

<p>
Construtor:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">&lt;&lt; e_1, ..., e_n &gt;&gt; <span style="color: #C18E76;">\* (e_1, ..., e_n)</span>
</pre>
</div>

<p>
Acesso:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">t[<span style="color: #d79921; font-weight: bold;">1</span>], t[<span style="color: #d79921; font-weight: bold;">2</span>], ... , t[<span style="color: #d79921; font-weight: bold;">50</span>] <span style="color: #C18E76;">\* t._1, t._2, ..., t._50</span>
</pre>
</div>

<p>
Obtendo todas as possíveis tuplas:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">S_1 \X S_2 \X ... \X S_n <span style="color: #C18E76;">\* tuples(S_1, S_2, ..., S_n)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unchanged-2" class="outline-3">
<h3 id="unchanged-2"><span class="section-number-3">1.25.</span> Unchanged</h3>
<div class="outline-text-3" id="text-1-25">
<p>
TLA+ fornece um operador para o caso especial onde uma variável se mantém com o mesmo valor em uma ação:<br />
</p>

<p>
Ao invés de escrevermos:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">MinhaAcao ==
  /\ a' = a
  /\ b' = b
</pre>
</div>

<p>
Podemos escrever:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">MinhaAcao ==
  <span style="color: #66a4a4;">UNCHANGED</span> &lt;&lt; a, b &gt;&gt;
</pre>
</div>
</div>
</div>
