mfo/20240331223036-mfo_introducao_ao_tla.org
** Folds
Não consegui descobir um jeito de fazer =EXTENDS= pela REPL. Então, vamos usar o VSCode com a funcionalidade de avaliação:
- Selecione o texto de uma *expressão*
- Aperte F1 e selecione TLA+: Evaluate selected expression

#+BEAMER: \medskip
#+BEAMER: \pause
Para usar o fold, precisamos de:
- =EXTENDS FiniteSetsExt= para =FoldSet=
- =EXTENDS SequencesExt= para =FoldSeq=

#+BEAMER: \medskip
#+BEAMER: \pause
Em Quint:
#+begin_src quint
Set(1, 2, 3, 4).fold(0, (acc, i) => acc + i)
#+end_src

#+BEAMER: \medskip
Em TLA+:
#+begin_src tla
FoldSet(LAMBDA i, acc : acc + i, 0, S)
#+end_src

** Exercícios Fold
Exercício: Re-escreva nossos exemplos anteriores usando =FoldSet=
Agora, resolva ambos usando =FoldSet=.

** Exercícios TLA+
1. Escreva um operador que recebe um conjunto e retorna a média dos valores.
2. Dado um conjunto de =records= como =[ nome |-> "Gabriela", idade |-> 25 ]=, escreva um operador que recebe esse conjunto e retorna a diferença de idade entre o mais velho e o mais novo.
3. Defina um valor que contenha todos os conjuntos possíveis com valores inteiros de 1 a 10, com tamanho maior que 2 e menor que 5.
4. Escreva um operador que calcule o fatorial de um número. Recursão não é permitida.
5. Escreva um operador que recebe uma lista e retorna um mapa onde as chaves são os elementos da lista, e os valores são inteiros representando a quantidade de ocorrências daquele elemento na lista.

#+BEAMER: \medskip
#+BEAMER: \pause
Dica: você vai precisar dos módulos importados pela expressão:
#+begin_src tla
EXTENDS FiniteSets, FiniteSetsExt, Integers, SequencesExt
#+end_src

# SelectSeq(<<1,2>>, LAMBDA x: x > 1)
