docs/mfo/20240331223036-mfo_introducao_ao_tla.html
<div id="outline-container-folds-2" class="outline-3">
<h3 id="folds-2"><span class="section-number-3">1.26.</span> Folds</h3>
<div class="outline-text-3" id="text-1-26">
<p>
Não consegui descobir um jeito de fazer <code>EXTENDS</code> pela REPL. Então, vamos usar o VSCode com a funcionalidade de avaliação:<br />
</p>
<ul class="org-ul">
<li>Selecione o texto de uma <b>expressão</b><br /></li>
<li>Aperte F1 e selecione TLA+: Evaluate selected expression<br /></li>
</ul>

<p>
Para usar o fold, precisamos de:<br />
</p>
<ul class="org-ul">
<li><code>EXTENDS FiniteSetsExt</code> para <code>FoldSet</code><br /></li>
<li><code>EXTENDS SequencesExt</code> para <code>FoldSeq</code><br /></li>
</ul>

<p>
Em Quint:<br />
</p>
<div class="org-src-container">
<pre class="src src-quint"><span style="color: #d79921;">Set</span>(1, 2, 3, 4).fold(0, (acc, i) =&gt; acc + i)
</pre>
</div>

<p>
Em TLA+:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla">FoldSet(<span style="color: #66a4a4;">LAMBDA</span> i, acc : acc + i, <span style="color: #d79921; font-weight: bold;">0</span>, S)
</pre>
</div>
</div>
</div>
<div id="outline-container-exerc-cios-fold-2" class="outline-3">
<h3 id="exerc-cios-fold-2"><span class="section-number-3">1.27.</span> Exercícios Fold</h3>
<div class="outline-text-3" id="text-1-27">
<p>
Exercício: Re-escreva nossos exemplos anteriores usando <code>FoldSet</code><br />
Agora, resolva ambos usando <code>FoldSet</code>.<br />
</p>
</div>
</div>
<div id="outline-container-exerc-cios-tla-2" class="outline-3">
<h3 id="exerc-cios-tla-2"><span class="section-number-3">1.28.</span> Exercícios TLA+</h3>
<div class="outline-text-3" id="text-1-28">
<ol class="org-ol">
<li>Escreva um operador que recebe um conjunto e retorna a média dos valores.<br /></li>
<li>Dado um conjunto de <code>records</code> como <code>[ nome |-&gt; "Gabriela", idade |-&gt; 25 ]</code>, escreva um operador que recebe esse conjunto e retorna a diferença de idade entre o mais velho e o mais novo.<br /></li>
<li>Defina um valor que contenha todos os conjuntos possíveis com valores inteiros de 1 a 10, com tamanho maior que 2 e menor que 5.<br /></li>
<li>Escreva um operador que calcule o fatorial de um número. Recursão não é permitida.<br /></li>
<li>Escreva um operador que recebe uma lista e retorna um mapa onde as chaves são os elementos da lista, e os valores são inteiros representando a quantidade de ocorrências daquele elemento na lista.<br /></li>
</ol>

<p>
Dica: você vai precisar dos módulos importados pela expressão:<br />
</p>
<div class="org-src-container">
<pre class="src src-tla"><span style="color: #66a4a4;">EXTENDS</span> FiniteSets, FiniteSetsExt, Integers, SequencesExt
</pre>
</div>
</div>
</div>
</div>

      </div>
    </div>
  </body>
</html>
